@echo off

# カレントディレクトリへ移動
pushd %~dp0

# ====================================
# 01 Zaimから情報を取得してCSVに出力
# ====================================
python 01createCsvForZaim.py

# ====================================
# 02 Zaimから予算情報を取得してCSVに出力
# ====================================
python 02createBudgetsCsvForZaim.py

# ====================================
# 03 if_zaimテーブルへCSVをインポート
# ====================================
python 03importCsvToIfZaim.py

# ====================================
# 04 if_zaim → recsavへのデータ連携
# ====================================
python 04ifZaimToRecsav.py

# ====================================
# 05 gcal → recsavへのデータ連携
# ====================================
python 05importGcalToRecsav.py

exit 0
