@echo off

REM カレントディレクトリへ移動
pushd %~dp0

REM =============================================================
REM 00 Webドライバーを最新化
REM =============================================================
python 00updateWebDriver.py

REM =============================================================
REM 10 楽天カードから情報を取得してCSVに出力
REM =============================================================
python 10createRakutenCardCsv.py

REM =============================================================
REM 11 if_rakuten_cardテーブルへCSVをインポート
REM =============================================================
python 11importCsvToIfRakutenCard.py

REM =============================================================
REM 12 if_rakuten_card → household_account_bookへのデータ連携
REM =============================================================
python 12ifRakutenCardToRecsav.py

exit 0
